{
  "id": "0615",
  "nombre": "Diseño de interfaces web",
  "creditos": "10",
  "descripcion": "Duración total: 132h, Centro: 66h, Empresa: 66h",
  "CE": [],
  "RA": [
    {
      "codigo": "RA1",
      "descripcion": "Planifica la creación de una interfaz web valorando y aplicando especificaciones de diseño.",
      "CE": [
        {
          "codigo": "CE1.1",
          "descripcion": "Reconoce la importancia de la comunicación visual y sus principios básicos"
        },
        {
          "codigo": "CE1.2",
          "descripcion": "Analiza y selecciona colores y tipografías adecuados para su visualización en pantalla"
        },
        {
          "codigo": "CE1.3",
          "descripcion": "Analiza alternativas para la presentación de información en documentos web"
        },
        {
          "codigo": "CE1.4",
          "descripcion": "Valora la importancia de definir y aplicar una guía de estilo en el desarrollo de una aplicación web"
        },
        {
          "codigo": "CE1.5",
          "descripcion": "Utiliza y valora diferentes tecnologías para el diseño de documentos web"
        },
        {
          "codigo": "CE1.6",
          "descripcion": "Crea y utiliza plantillas de diseño"
        },
        {
          "codigo": "CE1.7",
          "descripcion": "Crea interfaces web homogéneas definiendo y aplicando estilos"
        }
      ]
    },
    {
      "codigo": "RA2",
      "descripcion": "Crea interfaces web homogéneas definiendo y aplicando estilos.",
      "CE": [
        {
          "codigo": "CE2.1",
          "descripcion": "Reconoce las posibilidades de modificar etiquetas HTML"
        },
        {
          "codigo": "CE2.2",
          "descripcion": "Define estilos de forma directa"
        },
        {
          "codigo": "CE2.3",
          "descripcion": "Define y asocia estilos globales a hojas externas"
        },
        {
          "codigo": "CE2.4",
          "descripcion": "Define hojas de estilo alternativas"
        },
        {
          "codigo": "CE2.5",
          "descripcion": "Redefine estilos"
        },
        {
          "codigo": "CE2.6",
          "descripcion": "Identifica las distintas propiedades de cada elemento"
        },
        {
          "codigo": "CE2.7",
          "descripcion": "Crea clases de estilos"
        },
        {
          "codigo": "CE2.8",
          "descripcion": "Utiliza herramientas de validación de hojas de estilo"
        },
        {
          "codigo": "CE2.9",
          "descripcion": "Analiza y utiliza tecnologías y frameworks para crear interfaces web con diseño responsive"
        },
        {
          "codigo": "CE2.10",
          "descripcion": "Analiza y utiliza preprocesadores de estilos para traducir estilos comunes a un código estándar reconocido por los navegadores"
        }
      ]
    },
    {
      "codigo": "RA3",
      "descripcion": "Prepara archivos multimedia para la web, analizando sus características y utilizando herramientas específicas.",
      "CE": [
        {
          "codigo": "CE3.1",
          "descripcion": "Reconoce implicaciones de licencias y derechos de autor en el uso de material multimedia"
        },
        {
          "codigo": "CE3.2",
          "descripcion": "Identifica los formatos de imagen, audio y vídeo adecuados"
        },
        {
          "codigo": "CE3.3",
          "descripcion": "Analiza herramientas disponibles para generar contenido multimedia"
        },
        {
          "codigo": "CE3.4",
          "descripcion": "Emplea herramientas para el tratamiento digital de la imagen"
        },
        {
          "codigo": "CE3.5",
          "descripcion": "Utiliza herramientas para manipular audio y vídeo"
        },
        {
          "codigo": "CE3.6",
          "descripcion": "Realiza animaciones a partir de imágenes fijas"
        },
        {
          "codigo": "CE3.7",
          "descripcion": "Importa y exporta imágenes, audio y vídeo en varios formatos según su finalidad"
        },
        {
          "codigo": "CE3.8",
          "descripcion": "Aplica la guía de estilo"
        }
      ]
    },
    {
      "codigo": "RA4",
      "descripcion": "Integra contenido multimedia en documentos web valorando su aportación y seleccionando adecuadamente los elementos interactivos.",
      "CE": [
        {
          "codigo": "CE4.1",
          "descripcion": "Reconoce y analiza tecnologías relacionadas con la inclusión de contenido multimedia e interactivo"
        },
        {
          "codigo": "CE4.2",
          "descripcion": "Identifica configuraciones específicas necesarias en los navegadores para soportar contenido multimedia e interactivo"
        },
        {
          "codigo": "CE4.3",
          "descripcion": "Utiliza herramientas gráficas para el desarrollo de contenido multimedia interactivo"
        },
        {
          "codigo": "CE4.4",
          "descripcion": "Analiza el código generado por las herramientas de contenido interactivo"
        },
        {
          "codigo": "CE4.5",
          "descripcion": "Añade elementos multimedia a documentos web"
        },
        {
          "codigo": "CE4.6",
          "descripcion": "Añade interactividad a elementos de un documento web"
        },
        {
          "codigo": "CE4.7",
          "descripcion": "Verifica el funcionamiento de elementos multimedia e interactivos en diferentes navegadores y dispositivos"
        }
      ]
    },
    {
      "codigo": "RA5",
      "descripcion": "Desarrolla interfaces web accesibles analizando las pautas establecidas y aplicando técnicas de verificación.",
      "CE": [
        {
          "codigo": "CE5.1",
          "descripcion": "Reconoce la necesidad de diseñar webs accesibles"
        },
        {
          "codigo": "CE5.2",
          "descripcion": "Analiza la accesibilidad de distintos documentos web"
        },
        {
          "codigo": "CE5.3",
          "descripcion": "Analiza los principios y pautas de accesibilidad al contenido y sus niveles de conformidad"
        },
        {
          "codigo": "CE5.4",
          "descripcion": "Analiza posibles errores según los puntos de verificación de prioridad"
        },
        {
          "codigo": "CE5.5",
          "descripcion": "Alcanza el nivel de conformidad deseado"
        },
        {
          "codigo": "CE5.6",
          "descripcion": "Verifica niveles alcanzados mediante tests externos"
        },
        {
          "codigo": "CE5.7",
          "descripcion": "Verifica la visualización de la interfaz en distintos navegadores y tecnologías"
        },
        {
          "codigo": "CE5.8",
          "descripcion": "Analiza y utiliza herramientas y estrategias que mejoran la visibilidad y accesibilidad de sitios y páginas web en los resultados de buscadores"
        }
      ]
    },
    {
      "codigo": "RA6",
      "descripcion": "Desarrolla interfaces web amigables analizando y aplicando pautas de usabilidad establecidas.",
      "CE": [
        {
          "codigo": "CE6.1",
          "descripcion": "Analiza la usabilidad de diferentes documentos web"
        },
        {
          "codigo": "CE6.2",
          "descripcion": "Valora la importancia del uso de estándares en la creación de documentos web"
        },
        {
          "codigo": "CE6.3",
          "descripcion": "Modifica la interfaz web para adaptarla a sus objetivos y a su público"
        },
        {
          "codigo": "CE6.4",
          "descripcion": "Verifica la facilidad de navegación de un documento web mediante distintos periféricos"
        },
        {
          "codigo": "CE6.5",
          "descripcion": "Analiza técnicas para verificar la usabilidad de un documento web"
        },
        {
          "codigo": "CE6.6",
          "descripcion": "Verifica la usabilidad de la interfaz web creada en distintos navegadores y tecnologías"
        }
      ]
    }
  ]
}